Revit 2024 API
Revision.IssuedBy Property
 Indicates who has issued or will issue this Revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string IssuedBy { get; set; }
Visual Basic
Public Property IssuedBy As String
	Get
	Set
Visual C++
public:
property String^ IssuedBy {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This operation cannot be performed on Revisions that have already been issued.
See Also
Revision Class
Autodesk.Revit.DB Namespace